/**
 * @brief 2分ヒープのテストプログラム
 * @date  作成日    : 2016/02/15
 * @date  最終更新日 : 2016/02/15
 */



//****************************************
// 必要なヘッダファイルのインクルード
//****************************************

#include <iostream>
#include "pqueue.hpp"



//****************************************
// オブジェクト形式マクロの定義
//****************************************

#define N 256  // データの件数



//****************************************
// 関数の定義
//****************************************

int main(void)
{
    pqueue<int> pq(N);
    pq.emplace(3);
    pq.insert(2);
    pq.erase(1);
    pq.insert(15);
    pq.insert(5);
    pq.insert(4);
    pq.insert(45);

    std::cout << pq.extract() << " ";
    std::cout << pq[0] << " ";
    pq.update(2, 1);
    std::cout << pq[0] << std::endl;

    return 0;
}
