/**
 * @brief  最近点対の発見について扱います
 * @date   2016/03/22
 */



//****************************************
// インクルードガード
//****************************************

#ifndef __CLOSEST_PAIR_HPP__
#define __CLOSEST_PAIR_HPP__



//****************************************
// 必要なヘッダファイルのインクルード
//****************************************

#include "../Geometry/geometry.hpp"



//****************************************
// 関数の宣言
//****************************************





#endif  // end of __CLOSEST_PAIR_HPP__

